voltversa/Intelligent-Remote-Controlled-Antenna-Matrix-for-Shortwave-Radio/firmware/antenna_matrix_esp32.cpp
/*
  Intelligent HF Antenna Matrix
  ESP32 CYD + XPT2046 + MCP23017 + ADS1115 + Blynk

  Improvements in this revision:
  - Static GUI is drawn once; only changed fields are redrawn.
  - Wi-Fi and Blynk status icons are shown in the header.
  - Touch uses polling, lower pressure threshold, averaging, larger hit areas,
    and one-action-per-touch latching.
  - ESP32 task watchdog monitors loopTask.
  - Wi-Fi/Blynk reconnection is non-blocking and rate-limited.
  - Unused frequency-counter code and automatic boot relay test are removed.
  - ADS1115 channels are read with a dummy conversion after MUX changes.

  ADS1115 channel mapping:
    AIN0 -> TX1 forward detector  (VFRW1)
    AIN1 -> TX1 reflected detector (VREF1)
    AIN2 -> TX2 forward detector  (VFRW2)
    AIN3 -> TX2 reflected detector (VREF2)
*/

// -----------------------------------------------------------------------------
// Blynk and Wi-Fi credentials
// -----------------------------------------------------------------------------
#define BLYNK_TEMPLATE_ID   "TMPL5a_V3qF9u"
#define BLYNK_TEMPLATE_NAME "Antenna Matrix"
#define BLYNK_AUTH_TOKEN    "YOUR_BLYNK_AUTH_TOKEN"
#define TFT_BACKLIGHT_PIN 21
#include <Wire.h>
#include <SPI.h>
#include <math.h>
#include <TFT_eSPI.h>
#include <XPT2046_Touchscreen.h>
#include <Adafruit_MCP23X17.h>
#include <Adafruit_ADS1X15.h>
#include <WiFi.h>
#include <BlynkSimpleEsp32.h>
#include <esp_task_wdt.h>
#include <esp_idf_version.h>

char ssid[] = "YOUR_WIFI_NAME";
char pass[] = "YOUR_WIFI_PASSWORD";

// -----------------------------------------------------------------------------
// System constants
// -----------------------------------------------------------------------------
constexpr uint8_t NUM_ANTENNAS = 8;
constexpr uint8_t MCP_ADDR = 0x20;
constexpr uint8_t ADS_ADDR = 0x48;

constexpr uint32_t MEASUREMENT_INTERVAL_MS = 5000;
constexpr uint32_t BLYNK_PUBLISH_INTERVAL_MS = 1000;
constexpr uint32_t WIFI_RETRY_INTERVAL_MS = 10000;
constexpr uint32_t BLYNK_RETRY_INTERVAL_MS = 5000;
constexpr uint32_t WATCHDOG_TIMEOUT_MS = 12000;

constexpr float ADC_ZERO_THRESHOLD_V = 0.010f;
constexpr float RF_PRESENT_THRESHOLD_V = 0.150f;
constexpr float FILTER_ALPHA = 0.30f;

// Current provisional power calibration for a nominal -30 dB coupler.
// Replace these values after calibration with a known RF power meter.
constexpr float TX1_POWER_SCALE = 10.0f;
constexpr float TX2_POWER_SCALE = 10.0f;

// -----------------------------------------------------------------------------
// Touchscreen configuration
// -----------------------------------------------------------------------------
constexpr int TOUCH_MOSI = 32;
constexpr int TOUCH_MISO = 39;
constexpr int TOUCH_CLK  = 25;
constexpr int TOUCH_CS   = 33;

// IRQ is intentionally not used. GPIO36 is input-only and cannot use an
// internal pull-up on the classic ESP32. Polling is responsive enough here.
constexpr int TOUCH_MIN_Z = 90;
constexpr uint8_t TOUCH_SAMPLES = 3;
constexpr int TOUCH_HIT_MARGIN = 2;

constexpr int TS_MINX = 278;
constexpr int TS_MAXX = 3702;
constexpr int TS_MINY = 484;
constexpr int TS_MAXY = 3787;

// -----------------------------------------------------------------------------
// Relay configuration
// -----------------------------------------------------------------------------
constexpr uint8_t RELAY_ON = LOW;
constexpr uint8_t RELAY_OFF = HIGH;
constexpr uint16_t RELAY_SETTLE_MS = 25;

const uint8_t selectorPins[NUM_ANTENNAS] = {0, 1, 2, 3, 4, 5, 6, 7};
const uint8_t groundClampPins[NUM_ANTENNAS] = {8, 9, 10, 11, 12, 13, 14, 15};

// -----------------------------------------------------------------------------
// ADS1115 mapping
// -----------------------------------------------------------------------------
constexpr uint8_t CH_VFRW1 = 0;
constexpr uint8_t CH_VREF1 = 1;
constexpr uint8_t CH_VFRW2 = 2;
constexpr uint8_t CH_VREF2 = 3;

// -----------------------------------------------------------------------------
// Hardware objects
// -----------------------------------------------------------------------------
TFT_eSPI tft;
SPIClass touchSPI(VSPI);
XPT2046_Touchscreen touch(TOUCH_CS);
Adafruit_MCP23X17 mcp;
Adafruit_ADS1115 ads;
BlynkTimer blynkTimer;

bool mcpReady = false;
bool adsReady = false;
bool watchdogReady = false;

// -----------------------------------------------------------------------------
// Application state
// -----------------------------------------------------------------------------
enum AntennaState : uint8_t
{
  ANT_OFF = 0,
  ANT_BUS1,
  ANT_BUS2,
  ANT_PARK
};

AntennaState antennaState[NUM_ANTENNAS];
uint8_t selectedAntenna = 0;
bool tx1Locked = false;
bool tx2Locked = false;

struct RfMeasurement
{
  float forwardV = 0.0f;
  float reflectedV = 0.0f;
  float powerW = 0.0f;
  float swr = -1.0f;
  bool swrValid = false;
  bool initialized = false;
};

RfMeasurement tx1Measurement;
RfMeasurement tx2Measurement;

uint32_t lastMeasurementMs = 0;
uint32_t lastWifiAttemptMs = 0;
uint32_t lastBlynkAttemptMs = 0;

bool lastWifiConnected = false;
bool lastBlynkConnected = false;

// -----------------------------------------------------------------------------
// GUI layout
// -----------------------------------------------------------------------------
struct Button
{
  int16_t x;
  int16_t y;
  int16_t w;
  int16_t h;
  const char *label;
};

const Button antennaButtons[NUM_ANTENNAS] =
{
  {  6,  36, 50, 27, "ANT1"},
  { 60,  36, 50, 27, "ANT2"},
  {114,  36, 50, 27, "ANT3"},
  {168,  36, 50, 27, "ANT4"},
  {  6,  67, 50, 27, "ANT5"},
  { 60,  67, 50, 27, "ANT6"},
  {114,  67, 50, 27, "ANT7"},
  {168,  67, 50, 27, "ANT8"}
};

const Button buttonBus1 = {224, 36, 90, 27, "BUS 1"};
const Button buttonBus2 = {224, 67, 90, 27, "BUS 2"};
const Button buttonPark = {224, 98, 90, 27, "PARK"};

constexpr int16_t STATUS_X = 6;
constexpr int16_t STATUS_Y = 101;
constexpr int16_t STATUS_W = 212;
constexpr int16_t STATUS_H = 55;

constexpr int16_t TX1_CARD_X = 6;
constexpr int16_t TX2_CARD_X = 163;
constexpr int16_t CARD_Y = 162;
constexpr int16_t CARD_W = 151;
constexpr int16_t CARD_H = 72;

struct MeasurementUiCache
{
  char forwardText[16] = "";
  char reflectedText[16] = "";
  char powerText[16] = "";
  char swrText[16] = "";
  int8_t lockState = -1;
};

struct UiCache
{
  int16_t selected = -1;
  AntennaState states[NUM_ANTENNAS];
  int16_t bus1Antenna = -99;
  int16_t bus2Antenna = -99;
  bool initialized = false;
  int8_t wifiState = -1;
  int8_t blynkState = -1;
  MeasurementUiCache tx1;
  MeasurementUiCache tx2;
};

UiCache uiCache;

