voltversa/Intelligent-Remote-Controlled-Antenna-Matrix-for-Shortwave-Radio/firmware/antenna_matrix_esp32.cpp
/*
 * One small off-screen buffer is reused for both measurement cards.
 * Dynamic text is composed completely in RAM and then transferred to the
 * display in one operation, so the user never sees a cleared/blank field.
 */
TFT_eSprite measurementSprite(&tft);
bool measurementSpriteReady = false;

constexpr int16_t MEASUREMENT_SPRITE_X_OFFSET = 6;
constexpr int16_t MEASUREMENT_SPRITE_Y_OFFSET = 25;
constexpr int16_t MEASUREMENT_SPRITE_W = CARD_W - 12;
constexpr int16_t MEASUREMENT_SPRITE_H = CARD_H - 28;

// -----------------------------------------------------------------------------
// Forward declarations
// -----------------------------------------------------------------------------
void drawStaticGui();
void refreshStateGui(bool force = false);
void refreshMeasurementGui(bool force = false);
void refreshNetworkIcons(bool force = false);
void readMeasurements();
void publishBlynkStatus();
void serviceNetwork();

// -----------------------------------------------------------------------------
// Watchdog
// -----------------------------------------------------------------------------
void setupWatchdog()
{
#if ESP_IDF_VERSION_MAJOR >= 5
  esp_task_wdt_config_t config = {};
  config.timeout_ms = WATCHDOG_TIMEOUT_MS;
  config.idle_core_mask = 0;       // Monitor loopTask explicitly below.
  config.trigger_panic = true;     // Reset after the watchdog panic.

  esp_err_t result = esp_task_wdt_reconfigure(&config);
  if (result == ESP_ERR_INVALID_STATE)
  {
    result = esp_task_wdt_init(&config);
  }

  if ((result == ESP_OK) || (result == ESP_ERR_INVALID_STATE))
  {
    if (esp_task_wdt_status(nullptr) != ESP_OK)
    {
      result = esp_task_wdt_add(nullptr);
    }
    else
    {
      result = ESP_OK;
    }
  }

  watchdogReady = (result == ESP_OK);
#else
  esp_err_t result = esp_task_wdt_init(WATCHDOG_TIMEOUT_MS / 1000U, true);
  if ((result == ESP_OK) || (result == ESP_ERR_INVALID_STATE))
  {
    result = esp_task_wdt_add(nullptr);
    if (result == ESP_ERR_INVALID_ARG)
    {
      result = ESP_OK; // Current task was already subscribed.
    }
  }
  watchdogReady = (result == ESP_OK);
#endif

  Serial.println(watchdogReady ? "Watchdog ready." : "Watchdog setup failed.");
}

inline void feedWatchdog()
{
  if (watchdogReady)
  {
    esp_task_wdt_reset();
  }
}

// -----------------------------------------------------------------------------
// General helpers
// -----------------------------------------------------------------------------
bool isValidAntenna(uint8_t antenna)
{
  return antenna < NUM_ANTENNAS;
}

const char *stateToText(AntennaState state)
{
  switch (state)
  {
    case ANT_BUS1: return "BUS 1";
    case ANT_BUS2: return "BUS 2";
    case ANT_PARK: return "PARK";
    default:       return "OFF";
  }
}

uint16_t stateColour(AntennaState state)
{
  switch (state)
  {
    case ANT_BUS1: return TFT_DARKGREEN;
    case ANT_BUS2: return TFT_ORANGE;
    case ANT_PARK: return TFT_DARKGREY;
    default:       return TFT_NAVY;
  }
}

float clampFloat(float value, float minimum, float maximum)
{
  if (value < minimum) return minimum;
  if (value > maximum) return maximum;
  return value;
}

float applyZeroThreshold(float voltage)
{
  return (voltage < ADC_ZERO_THRESHOLD_V) ? 0.0f : voltage;
}

float smoothValue(float previous, float current, bool initialized)
{
  if (!initialized || current == 0.0f || previous == 0.0f)
  {
    return current;
  }
  return previous + FILTER_ALPHA * (current - previous);
}

// -----------------------------------------------------------------------------
// RF calculations
// -----------------------------------------------------------------------------
float calculatePowerW(float forwardV, float scale)
{
  if (forwardV < ADC_ZERO_THRESHOLD_V)
  {
    return 0.0f;
  }
  return scale * forwardV * forwardV;
}

bool validSWRInput(float forwardV, float reflectedV)
{
  if (forwardV < RF_PRESENT_THRESHOLD_V) return false;
  if (reflectedV < 0.0f) return false;
  if (reflectedV >= forwardV) return false;
  if ((forwardV - reflectedV) < 0.05f) return false;
  return true;
}

float calculateSWR(float forwardV, float reflectedV)
{
  if (!validSWRInput(forwardV, reflectedV))
  {
    return -1.0f;
  }

  // For matched forward/reflected envelope detectors, the detector outputs
  // are treated as proportional to RF voltage. Final calibration is required.
  float gamma = reflectedV / forwardV;
  gamma = clampFloat(gamma, 0.0f, 0.95f);

  return clampFloat((1.0f + gamma) / (1.0f - gamma), 1.0f, 9.99f);
}

// -----------------------------------------------------------------------------
// Relay control and interlock
// -----------------------------------------------------------------------------
int findAntennaOnBus(AntennaState bus)
{
  for (uint8_t antenna = 0; antenna < NUM_ANTENNAS; antenna++)
  {
    if (antennaState[antenna] == bus)
    {
      return antenna;
    }
  }
  return -1;
}

int currentBusOfAntenna(uint8_t antenna)
{
  if (!isValidAntenna(antenna)) return 0;
  if (antennaState[antenna] == ANT_BUS1) return 1;
  if (antennaState[antenna] == ANT_BUS2) return 2;
  return 0;
}

bool actionBlocked(uint8_t antenna, AntennaState requestedState)
{
  const int currentBus = currentBusOfAntenna(antenna);

  if ((requestedState == ANT_BUS1) && tx1Locked) return true;
  if ((requestedState == ANT_BUS2) && tx2Locked) return true;

  if ((currentBus == 1) && tx1Locked && (requestedState != ANT_BUS1)) return true;
  if ((currentBus == 2) && tx2Locked && (requestedState != ANT_BUS2)) return true;

  return false;
}

void parkAntennaHardware(uint8_t antenna)
{
  if (!mcpReady || !isValidAntenna(antenna)) return;

  // The ground-clamp relay isolates the antenna from the selector path and
  // connects it to ground in the PARK state.
  mcp.digitalWrite(groundClampPins[antenna], RELAY_ON);
  antennaState[antenna] = ANT_PARK;
}

void connectAntennaHardware(uint8_t antenna, AntennaState destination)
{
  if (!mcpReady || !isValidAntenna(antenna)) return;

