voltversa/Intelligent-Remote-Controlled-Antenna-Matrix-for-Shortwave-Radio/firmware/antenna_matrix_esp32.cpp
  // Preserve the relay sequence and polarity used by the working prototype:
  // release the ground clamp, wait, then set the selector relay.
  mcp.digitalWrite(groundClampPins[antenna], RELAY_OFF);
  delay(RELAY_SETTLE_MS);

  const uint8_t selectorLevel =
      (destination == ANT_BUS1) ? RELAY_ON : RELAY_OFF;
  mcp.digitalWrite(selectorPins[antenna], selectorLevel);

  antennaState[antenna] = destination;
}

bool requestAntennaState(uint8_t antenna, AntennaState requestedState)
{
  if (!mcpReady)
  {
    Serial.println("Switching rejected: MCP23017 unavailable.");
    return false;
  }

  if (!isValidAntenna(antenna))
  {
    Serial.println("Switching rejected: invalid antenna.");
    return false;
  }

  if (actionBlocked(antenna, requestedState))
  {
    Serial.println("Switching blocked by TX lock.");
    return false;
  }

  if (requestedState == antennaState[antenna])
  {
    return true;
  }

  Serial.printf("ANT%u -> %s\n", antenna + 1, stateToText(requestedState));

  if (requestedState == ANT_PARK)
  {
    parkAntennaHardware(antenna);
    refreshStateGui();
    return true;
  }

  if ((requestedState != ANT_BUS1) && (requestedState != ANT_BUS2))
  {
    return false;
  }

  const int occupiedAntenna = findAntennaOnBus(requestedState);
  if ((occupiedAntenna >= 0) && (occupiedAntenna != antenna))
  {
    parkAntennaHardware((uint8_t)occupiedAntenna);
    delay(RELAY_SETTLE_MS);
  }

  if ((antennaState[antenna] == ANT_BUS1) ||
      (antennaState[antenna] == ANT_BUS2))
  {
    parkAntennaHardware(antenna);
    delay(RELAY_SETTLE_MS);
  }

  connectAntennaHardware(antenna, requestedState);
  refreshStateGui();
  return true;
}

void initializeRelayOutputs()
{
  for (uint8_t antenna = 0; antenna < NUM_ANTENNAS; antenna++)
  {
    antennaState[antenna] = ANT_PARK;

    // Configure selector first, then force the clamp into the safe PARK state.
    mcp.pinMode(selectorPins[antenna], OUTPUT);
    mcp.digitalWrite(selectorPins[antenna], RELAY_OFF);

    mcp.pinMode(groundClampPins[antenna], OUTPUT);
    mcp.digitalWrite(groundClampPins[antenna], RELAY_ON);
  }
}

// -----------------------------------------------------------------------------
// ADS1115 acquisition
// -----------------------------------------------------------------------------
float readAdcVoltage(uint8_t channel)
{
  if (!adsReady || channel > 3)
  {
    return 0.0f;
  }

  // Discard the first result after switching the internal ADS1115 MUX.
  (void)ads.readADC_SingleEnded(channel);

  constexpr uint8_t SAMPLE_COUNT = 4;
  int32_t sum = 0;

  for (uint8_t sample = 0; sample < SAMPLE_COUNT; sample++)
  {
    sum += ads.readADC_SingleEnded(channel);
  }

  const int16_t averageRaw = (int16_t)lroundf(sum / (float)SAMPLE_COUNT);
  return applyZeroThreshold(ads.computeVolts(averageRaw));
}

void updateMeasurement(
    RfMeasurement &measurement,
    float rawForward,
    float rawReflected,
    float powerScale)
{
  measurement.forwardV = smoothValue(
      measurement.forwardV,
      rawForward,
      measurement.initialized);

  measurement.reflectedV = smoothValue(
      measurement.reflectedV,
      rawReflected,
      measurement.initialized);

  measurement.powerW = calculatePowerW(measurement.forwardV, powerScale);
  measurement.swrValid = validSWRInput(
      measurement.forwardV,
      measurement.reflectedV);

  measurement.swr = measurement.swrValid
      ? calculateSWR(measurement.forwardV, measurement.reflectedV)
      : -1.0f;

  measurement.initialized = true;
}

void readMeasurements()
{
  if (!adsReady)
  {
    return;
  }

  const float fwd1 = readAdcVoltage(CH_VFRW1);
  const float ref1 = readAdcVoltage(CH_VREF1);
  const float fwd2 = readAdcVoltage(CH_VFRW2);
  const float ref2 = readAdcVoltage(CH_VREF2);

  updateMeasurement(tx1Measurement, fwd1, ref1, TX1_POWER_SCALE);
  updateMeasurement(tx2Measurement, fwd2, ref2, TX2_POWER_SCALE);
}

// -----------------------------------------------------------------------------
// GUI primitives
// -----------------------------------------------------------------------------
void drawButton(const Button &button, uint16_t fill, uint16_t text, uint16_t border)
{
  tft.fillRoundRect(button.x, button.y, button.w, button.h, 6, fill);
  tft.drawRoundRect(button.x, button.y, button.w, button.h, 6, border);
  tft.setTextDatum(MC_DATUM);
  tft.setTextColor(text, fill);
  tft.drawString(button.label,
                 button.x + button.w / 2,
                 button.y + button.h / 2,
                 2);
}

void drawAntennaButton(uint8_t antenna)
{
  const bool selected = (antenna == selectedAntenna);
  const uint16_t fill = stateColour(antennaState[antenna]);
  const uint16_t text = (antennaState[antenna] == ANT_BUS2) ? TFT_BLACK : TFT_WHITE;
  const uint16_t border = selected ? TFT_YELLOW : TFT_LIGHTGREY;

  drawButton(antennaButtons[antenna], fill, text, border);

  if (selected)
  {
    tft.drawRoundRect(
        antennaButtons[antenna].x + 2,
        antennaButtons[antenna].y + 2,
        antennaButtons[antenna].w - 4,
        antennaButtons[antenna].h - 4,
        4,
        TFT_YELLOW);
  }
}

void drawWifiIcon(int16_t x, int16_t y, bool connected)
{
  const uint16_t colour = connected ? TFT_GREEN : TFT_DARKGREY;
  tft.fillRect(x - 12, y - 11, 24, 22, TFT_BLACK);

  // Three simple chevrons make a compact Wi-Fi icon without external assets.
  tft.drawLine(x - 9, y - 4, x, y - 10, colour);
  tft.drawLine(x, y - 10, x + 9, y - 4, colour);
  tft.drawLine(x - 6, y + 1, x, y - 3, colour);
  tft.drawLine(x, y - 3, x + 6, y + 1, colour);
  tft.drawLine(x - 3, y + 5, x, y + 3, colour);
  tft.drawLine(x, y + 3, x + 3, y + 5, colour);
  tft.fillCircle(x, y + 8, 2, colour);
}

void drawCloudIcon(int16_t x, int16_t y, bool connected)
{
  const uint16_t colour = connected ? TFT_GREEN : TFT_DARKGREY;
  tft.fillRect(x - 13, y - 11, 27, 22, TFT_BLACK);
  tft.drawCircle(x - 6, y + 1, 5, colour);
  tft.drawCircle(x, y - 3, 6, colour);
  tft.drawCircle(x + 7, y + 1, 5, colour);
  tft.drawLine(x - 10, y + 6, x + 11, y + 6, colour);
  tft.fillCircle(x + 10, y - 7, 2, connected ? TFT_GREEN : TFT_RED);
}

void drawLockIcon(int16_t x, int16_t y, bool locked, uint16_t background)
{
  const uint16_t colour = locked ? TFT_RED : TFT_GREEN;
  tft.fillRect(x - 9, y - 9, 19, 19, background);
  tft.drawRoundRect(x - 5, y - 1, 11, 9, 2, colour);
  tft.drawCircle(x, y - 2, 5, colour);
  tft.fillRect(x - 6, y - 2, 13, 5, background);
  tft.drawRoundRect(x - 5, y - 1, 11, 9, 2, colour);
}

