voltversa/Intelligent-Remote-Controlled-Antenna-Matrix-for-Shortwave-Radio/firmware/antenna_matrix_esp32.cpp
void drawMeasurementCardStatic(int16_t x, const char *title)
{
  tft.fillRoundRect(x, CARD_Y, CARD_W, CARD_H, 8, TFT_NAVY);
  tft.drawRoundRect(x, CARD_Y, CARD_W, CARD_H, 8, TFT_DARKGREY);
  tft.setTextDatum(TL_DATUM);
  tft.setTextColor(TFT_CYAN, TFT_NAVY);
  tft.drawString(title, x + 8, CARD_Y + 5, 2);

  tft.drawFastHLine(x + 6, CARD_Y + 22, CARD_W - 12, TFT_DARKGREY);
}

void drawStaticGui()
{
  tft.fillScreen(TFT_BLACK);

  // Header
  tft.fillRect(0, 0, 320, 31, TFT_BLACK);
  tft.drawFastHLine(0, 30, 320, TFT_DARKGREY);
  tft.setTextDatum(TL_DATUM);
  tft.setTextColor(TFT_CYAN, TFT_BLACK);
  tft.drawString("HF ANTENNA MATRIX", 8, 7, 2);

  // Action buttons and antenna buttons
  for (uint8_t antenna = 0; antenna < NUM_ANTENNAS; antenna++)
  {
    drawAntennaButton(antenna);
  }

  drawButton(buttonBus1, TFT_DARKGREEN, TFT_WHITE, TFT_GREEN);
  drawButton(buttonBus2, TFT_ORANGE, TFT_BLACK, TFT_YELLOW);
  drawButton(buttonPark, TFT_MAROON, TFT_WHITE, TFT_RED);

  // Selected-antenna status card
  tft.fillRoundRect(STATUS_X, STATUS_Y, STATUS_W, STATUS_H, 8, TFT_NAVY);
  tft.drawRoundRect(STATUS_X, STATUS_Y, STATUS_W, STATUS_H, 8, TFT_DARKGREY);

  // Measurement cards
  drawMeasurementCardStatic(TX1_CARD_X, "TX1");
  drawMeasurementCardStatic(TX2_CARD_X, "TX2");

  uiCache.initialized = false;
  refreshStateGui(true);
  refreshMeasurementGui(true);
  refreshNetworkIcons(true);
}

void refreshNetworkIcons(bool force)
{
  const bool wifiConnected = (WiFi.status() == WL_CONNECTED);
  const bool blynkConnected = wifiConnected && Blynk.connected();

  if (force || (uiCache.wifiState != (int8_t)wifiConnected))
  {
    drawWifiIcon(270, 14, wifiConnected);
    uiCache.wifiState = wifiConnected;
  }

  if (force || (uiCache.blynkState != (int8_t)blynkConnected))
  {
    drawCloudIcon(302, 14, blynkConnected);
    uiCache.blynkState = blynkConnected;
  }
}

void refreshStateGui(bool force)
{
  const int bus1Antenna = findAntennaOnBus(ANT_BUS1);
  const int bus2Antenna = findAntennaOnBus(ANT_BUS2);
  const bool selectedChanged =
      force || !uiCache.initialized || (uiCache.selected != selectedAntenna);
  const bool selectedStateChanged =
      force || !uiCache.initialized ||
      (uiCache.states[selectedAntenna] != antennaState[selectedAntenna]);

  for (uint8_t antenna = 0; antenna < NUM_ANTENNAS; antenna++)
  {
    if (force ||
        !uiCache.initialized ||
        (uiCache.states[antenna] != antennaState[antenna]) ||
        selectedChanged)
    {
      drawAntennaButton(antenna);
      uiCache.states[antenna] = antennaState[antenna];
    }
  }

  if (force ||
      !uiCache.initialized ||
      selectedChanged ||
      selectedStateChanged ||
      (uiCache.bus1Antenna != bus1Antenna) ||
      (uiCache.bus2Antenna != bus2Antenna))
  {
    char line[28];

    tft.fillRect(STATUS_X + 6, STATUS_Y + 6, STATUS_W - 12, 20, TFT_NAVY);
    snprintf(line, sizeof(line), "ANT%u  %s",
             selectedAntenna + 1,
             stateToText(antennaState[selectedAntenna]));
    tft.setTextDatum(TL_DATUM);
    tft.setTextColor(TFT_WHITE, TFT_NAVY);
    tft.drawString(line, STATUS_X + 8, STATUS_Y + 7, 2);

    tft.fillRoundRect(STATUS_X + 8, STATUS_Y + 31, 82, 18, 4, TFT_DARKGREEN);
    tft.setTextColor(TFT_WHITE, TFT_DARKGREEN);
    snprintf(line, sizeof(line), "BUS1: %d", (bus1Antenna >= 0) ? bus1Antenna + 1 : 0);
    tft.drawString(line, STATUS_X + 13, STATUS_Y + 33, 2);

    tft.fillRoundRect(STATUS_X + 115, STATUS_Y + 31, 82, 18, 4, TFT_ORANGE);
    tft.setTextColor(TFT_BLACK, TFT_ORANGE);
    snprintf(line, sizeof(line), "BUS2: %d", (bus2Antenna >= 0) ? bus2Antenna + 1 : 0);
    tft.drawString(line, STATUS_X + 120, STATUS_Y + 33, 2);
  }

  if (force || (uiCache.tx1.lockState != (int8_t)tx1Locked))
  {
    drawLockIcon(TX1_CARD_X + CARD_W - 17, CARD_Y + 12, tx1Locked, TFT_NAVY);
    uiCache.tx1.lockState = tx1Locked;
  }

  if (force || (uiCache.tx2.lockState != (int8_t)tx2Locked))
  {
    drawLockIcon(TX2_CARD_X + CARD_W - 17, CARD_Y + 12, tx2Locked, TFT_NAVY);
    uiCache.tx2.lockState = tx2Locked;
  }

  uiCache.selected = selectedAntenna;
  uiCache.bus1Antenna = bus1Antenna;
  uiCache.bus2Antenna = bus2Antenna;
  uiCache.initialized = true;
}

void formatMeasurementTexts(
    const RfMeasurement &measurement,
    char *forward,
    size_t forwardSize,
    char *reflected,
    size_t reflectedSize,
    char *power,
    size_t powerSize,
    char *swr,
    size_t swrSize)
{
  if (!adsReady)
  {
    snprintf(forward, forwardSize, "F ADC ERR");
    snprintf(reflected, reflectedSize, "R ADC ERR");
    snprintf(power, powerSize, "P ---");
    snprintf(swr, swrSize, "S ---");
    return;
  }

  snprintf(forward, forwardSize, "F %.2fV", measurement.forwardV);
  snprintf(reflected, reflectedSize, "R %.2fV", measurement.reflectedV);

  if (measurement.powerW < 100.0f)
  {
    snprintf(power, powerSize, "P %.1fW", measurement.powerW);
  }
  else
  {
    snprintf(power, powerSize, "P %.0fW", measurement.powerW);
  }

  if (measurement.swrValid)
  {
    snprintf(swr, swrSize, "S %.2f", measurement.swr);
  }
  else
  {
    snprintf(swr, swrSize, "S ---");
  }
}

bool measurementCardChanged(
    const char *forward,
    const char *reflected,
    const char *power,
    const char *swr,
    const MeasurementUiCache &cache,
    bool force)
{
  return force ||
         (strcmp(forward, cache.forwardText) != 0) ||
         (strcmp(reflected, cache.reflectedText) != 0) ||
         (strcmp(power, cache.powerText) != 0) ||
         (strcmp(swr, cache.swrText) != 0);
}

void saveMeasurementTexts(
    MeasurementUiCache &cache,
    const char *forward,
    const char *reflected,
    const char *power,
    const char *swr)
{
  snprintf(cache.forwardText, sizeof(cache.forwardText), "%s", forward);
  snprintf(cache.reflectedText, sizeof(cache.reflectedText), "%s", reflected);
  snprintf(cache.powerText, sizeof(cache.powerText), "%s", power);
  snprintf(cache.swrText, sizeof(cache.swrText), "%s", swr);
}

void drawMeasurementCardFallback(
    int16_t cardX,
    const char *forward,
    const char *reflected,
    const char *power,
    const char *swr,
    uint16_t swrColour)
{
  /*
   * Fallback for the unlikely case that sprite allocation fails.
   * setTextPadding() replaces the previous text without explicitly clearing
   * the rectangle first, which is still less visible than fillRect()+draw.
   */
  tft.setTextDatum(TL_DATUM);

