voltversa/Intelligent-Remote-Controlled-Antenna-Matrix-for-Shortwave-Radio/firmware/antenna_matrix_esp32.cpp
  tft.setTextPadding(68);
  tft.setTextColor(TFT_WHITE, TFT_NAVY);
  tft.drawString(forward, cardX + 7, CARD_Y + 28, 2);

  tft.setTextColor(TFT_LIGHTGREY, TFT_NAVY);
  tft.drawString(reflected, cardX + 7, CARD_Y + 49, 2);

  tft.setTextPadding(67);
  tft.setTextColor(TFT_CYAN, TFT_NAVY);
  tft.drawString(power, cardX + 77, CARD_Y + 28, 2);

  tft.setTextColor(swrColour, TFT_NAVY);
  tft.drawString(swr, cardX + 77, CARD_Y + 49, 2);

  tft.setTextPadding(0);
}

void drawMeasurementCardSprite(
    int16_t cardX,
    const char *forward,
    const char *reflected,
    const char *power,
    const char *swr,
    uint16_t swrColour)
{
  if (!measurementSpriteReady)
  {
    drawMeasurementCardFallback(
        cardX, forward, reflected, power, swr, swrColour);
    return;
  }

  /*
   * Build the entire dynamic part of one card off screen.
   * The display receives one completed rectangle; no blank intermediate
   * rectangle is ever visible.
   */
  measurementSprite.fillSprite(TFT_NAVY);
  measurementSprite.setTextDatum(TL_DATUM);
  measurementSprite.setTextPadding(0);

  measurementSprite.setTextColor(TFT_WHITE, TFT_NAVY);
  measurementSprite.drawString(forward, 1, 3, 2);

  measurementSprite.setTextColor(TFT_LIGHTGREY, TFT_NAVY);
  measurementSprite.drawString(reflected, 1, 24, 2);

  measurementSprite.setTextColor(TFT_CYAN, TFT_NAVY);
  measurementSprite.drawString(power, 71, 3, 2);

  measurementSprite.setTextColor(swrColour, TFT_NAVY);
  measurementSprite.drawString(swr, 71, 24, 2);

  measurementSprite.pushSprite(
      cardX + MEASUREMENT_SPRITE_X_OFFSET,
      CARD_Y + MEASUREMENT_SPRITE_Y_OFFSET);
}

void refreshOneMeasurementCard(
    int16_t cardX,
    const RfMeasurement &measurement,
    MeasurementUiCache &cache,
    bool force)
{
  char forward[16];
  char reflected[16];
  char power[16];
  char swr[16];

  formatMeasurementTexts(
      measurement,
      forward, sizeof(forward),
      reflected, sizeof(reflected),
      power, sizeof(power),
      swr, sizeof(swr));

  if (!measurementCardChanged(
          forward, reflected, power, swr, cache, force))
  {
    return;
  }

  drawMeasurementCardSprite(
      cardX,
      forward,
      reflected,
      power,
      swr,
      measurement.swrValid ? TFT_GREEN : TFT_DARKGREY);

  saveMeasurementTexts(cache, forward, reflected, power, swr);
}

void refreshMeasurementGui(bool force)
{
  refreshOneMeasurementCard(
      TX1_CARD_X,
      tx1Measurement,
      uiCache.tx1,
      force);

  refreshOneMeasurementCard(
      TX2_CARD_X,
      tx2Measurement,
      uiCache.tx2,
      force);
}

// -----------------------------------------------------------------------------
// Touch handling
// -----------------------------------------------------------------------------
bool pointInButton(int16_t x, int16_t y, const Button &button)
{
  return x >= (button.x - TOUCH_HIT_MARGIN) &&
         x <= (button.x + button.w + TOUCH_HIT_MARGIN) &&
         y >= (button.y - TOUCH_HIT_MARGIN) &&
         y <= (button.y + button.h + TOUCH_HIT_MARGIN);
}

bool readTouchPoint(int16_t &screenX, int16_t &screenY)
{
  if (!touch.touched())
  {
    return false;
  }

  int32_t rawXSum = 0;
  int32_t rawYSum = 0;
  uint8_t validSamples = 0;

  for (uint8_t sample = 0; sample < TOUCH_SAMPLES; sample++)
  {
    const TS_Point point = touch.getPoint();

    if (point.z >= TOUCH_MIN_Z)
    {
      rawXSum += point.x;
      rawYSum += point.y;
      validSamples++;
    }

    delay(2);
  }

  if (validSamples < 2)
  {
    return false;
  }

  const int32_t rawX = rawXSum / validSamples;
  const int32_t rawY = rawYSum / validSamples;

  screenX = constrain(map(rawX, TS_MINX, TS_MAXX, 0, 320), 0, 319);
  screenY = constrain(map(rawY, TS_MINY, TS_MAXY, 0, 240), 0, 239);
  return true;
}

void handleTouch()
{
  static bool touchLatched = false;

  int16_t x = 0;
  int16_t y = 0;
  const bool pressed = readTouchPoint(x, y);

  if (!pressed)
  {
    touchLatched = false;
    return;
  }

  // Process one action only. A new action requires finger release first.
  if (touchLatched)
  {
    return;
  }
  touchLatched = true;

  for (uint8_t antenna = 0; antenna < NUM_ANTENNAS; antenna++)
  {
    if (pointInButton(x, y, antennaButtons[antenna]))
    {
      selectedAntenna = antenna;
      refreshStateGui();
      return;
    }
  }

  if (pointInButton(x, y, buttonBus1))
  {
    requestAntennaState(selectedAntenna, ANT_BUS1);
    return;
  }

  if (pointInButton(x, y, buttonBus2))
  {
    requestAntennaState(selectedAntenna, ANT_BUS2);
    return;
  }

  if (pointInButton(x, y, buttonPark))
  {
    requestAntennaState(selectedAntenna, ANT_PARK);
    return;
  }
}

// -----------------------------------------------------------------------------
// Blynk
// -----------------------------------------------------------------------------
void publishBlynkStatus()
{
  if ((WiFi.status() != WL_CONNECTED) || !Blynk.connected())
  {
    return;
  }

  const int bus1Antenna = findAntennaOnBus(ANT_BUS1);
  const int bus2Antenna = findAntennaOnBus(ANT_BUS2);

  Blynk.virtualWrite(V0, selectedAntenna + 1);
  Blynk.virtualWrite(V4, (bus1Antenna >= 0) ? bus1Antenna + 1 : 0);
  Blynk.virtualWrite(V5, (bus2Antenna >= 0) ? bus2Antenna + 1 : 0);
  Blynk.virtualWrite(V6, tx1Measurement.powerW);
  Blynk.virtualWrite(V7, tx1Measurement.swrValid ? tx1Measurement.swr : 0.0f);
  Blynk.virtualWrite(V8, tx2Measurement.powerW);
  Blynk.virtualWrite(V9, tx2Measurement.swrValid ? tx2Measurement.swr : 0.0f);
  Blynk.virtualWrite(V10, tx1Locked ? 1 : 0);
  Blynk.virtualWrite(V11, tx2Locked ? 1 : 0);
}

BLYNK_CONNECTED()
{
  Blynk.syncVirtual(V0, V10, V11);
  publishBlynkStatus();
}

BLYNK_WRITE(V0)
{
  const int antenna = param.asInt();
  if ((antenna >= 1) && (antenna <= NUM_ANTENNAS))
  {
    selectedAntenna = (uint8_t)(antenna - 1);
    refreshStateGui();
  }
}

BLYNK_WRITE(V1)
{
  if (param.asInt())
  {
    requestAntennaState(selectedAntenna, ANT_BUS1);
    Blynk.virtualWrite(V1, 0);
  }
}

BLYNK_WRITE(V2)
{
  if (param.asInt())
  {
    requestAntennaState(selectedAntenna, ANT_BUS2);
    Blynk.virtualWrite(V2, 0);
  }
}

BLYNK_WRITE(V3)
{
  if (param.asInt())
  {
    requestAntennaState(selectedAntenna, ANT_PARK);
    Blynk.virtualWrite(V3, 0);
  }
}

