voltversa/Intelligent-Remote-Controlled-Antenna-Matrix-for-Shortwave-Radio/firmware/antenna_matrix_esp32.cpp
BLYNK_WRITE(V10)
{
  tx1Locked = (param.asInt() != 0);
  refreshStateGui();
}

BLYNK_WRITE(V11)
{
  tx2Locked = (param.asInt() != 0);
  refreshStateGui();
}

// -----------------------------------------------------------------------------
// Non-blocking network service
// -----------------------------------------------------------------------------
void startWifiAttempt()
{
  lastWifiAttemptMs = millis();
  Serial.println("Starting Wi-Fi connection...");
  WiFi.begin(ssid, pass);
}

void serviceNetwork()
{
  const uint32_t now = millis();
  const bool wifiConnected = (WiFi.status() == WL_CONNECTED);

  if (!wifiConnected)
  {
    if ((now - lastWifiAttemptMs) >= WIFI_RETRY_INTERVAL_MS)
    {
      startWifiAttempt();
    }
  }
  else
  {
    Blynk.run();

    if (!Blynk.connected() &&
        ((now - lastBlynkAttemptMs) >= BLYNK_RETRY_INTERVAL_MS))
    {
      lastBlynkAttemptMs = now;
      feedWatchdog();
      (void)Blynk.connect(250); // Limit UI interruption to about 250 ms.
      feedWatchdog();
    }
  }

  const bool blynkConnected = wifiConnected && Blynk.connected();

  if ((wifiConnected != lastWifiConnected) ||
      (blynkConnected != lastBlynkConnected))
  {
    Serial.printf("Wi-Fi:%s  Blynk:%s\n",
                  wifiConnected ? "ON" : "OFF",
                  blynkConnected ? "ON" : "OFF");

    lastWifiConnected = wifiConnected;
    lastBlynkConnected = blynkConnected;
    refreshNetworkIcons();
  }
}

// -----------------------------------------------------------------------------
// Serial diagnostics
// -----------------------------------------------------------------------------
void printStates()
{
  Serial.println("---- ANTENNA STATES ----");
  for (uint8_t antenna = 0; antenna < NUM_ANTENNAS; antenna++)
  {
    Serial.printf("ANT%u: %s\n", antenna + 1, stateToText(antennaState[antenna]));
  }
  Serial.printf("BUS1:%d BUS2:%d TX1LOCK:%d TX2LOCK:%d\n",
                findAntennaOnBus(ANT_BUS1) + 1,
                findAntennaOnBus(ANT_BUS2) + 1,
                tx1Locked,
                tx2Locked);
}

void printMeasurements()
{
  Serial.printf("TX1 F=%.4fV R=%.4fV P=%.2fW SWR=",
                tx1Measurement.forwardV,
                tx1Measurement.reflectedV,
                tx1Measurement.powerW);
  if (tx1Measurement.swrValid) Serial.printf("%.2f\n", tx1Measurement.swr);
  else Serial.println("---");

  Serial.printf("TX2 F=%.4fV R=%.4fV P=%.2fW SWR=",
                tx2Measurement.forwardV,
                tx2Measurement.reflectedV,
                tx2Measurement.powerW);
  if (tx2Measurement.swrValid) Serial.printf("%.2f\n", tx2Measurement.swr);
  else Serial.println("---");
}

void processSerialCommand(String command)
{
  command.trim();
  command.toLowerCase();

  if (command == "state")
  {
    printStates();
    return;
  }

  if (command == "adc")
  {
    printMeasurements();
    return;
  }

  if (command == "allp")
  {
    for (uint8_t antenna = 0; antenna < NUM_ANTENNAS; antenna++)
    {
      if (!actionBlocked(antenna, ANT_PARK))
      {
        parkAntennaHardware(antenna);
      }
    }
    refreshStateGui();
    return;
  }

  if (command.startsWith("sel"))
  {
    const int antenna = command.substring(3).toInt();
    if ((antenna >= 1) && (antenna <= NUM_ANTENNAS))
    {
      selectedAntenna = (uint8_t)(antenna - 1);
      refreshStateGui();
    }
    return;
  }

  if (command == "tx1on")  { tx1Locked = true;  refreshStateGui(); return; }
  if (command == "tx1off") { tx1Locked = false; refreshStateGui(); return; }
  if (command == "tx2on")  { tx2Locked = true;  refreshStateGui(); return; }
  if (command == "tx2off") { tx2Locked = false; refreshStateGui(); return; }

  if (command.length() >= 2)
  {
    const char first = command.charAt(0);
    if ((first >= '1') && (first <= '8'))
    {
      const uint8_t antenna = (uint8_t)(first - '1');
      if (command.endsWith("b1")) { requestAntennaState(antenna, ANT_BUS1); return; }
      if (command.endsWith("b2")) { requestAntennaState(antenna, ANT_BUS2); return; }
      if (command.endsWith("p"))  { requestAntennaState(antenna, ANT_PARK); return; }
    }
  }

  Serial.println("Commands: state, adc, allp, sel1..sel8, 1b1..8b1, 1b2..8b2, 1p..8p, tx1on/off, tx2on/off");
}

// -----------------------------------------------------------------------------
// Setup and loop
// -----------------------------------------------------------------------------
void setup()
{
  Serial.begin(115200);
  Serial.setTimeout(25);
  delay(200);

  setupWatchdog();
  feedWatchdog();

  tft.init();
  tft.setRotation(1);
  tft.fillScreen(TFT_BLACK);

  measurementSprite.setColorDepth(16);
  measurementSpriteReady =
      (measurementSprite.createSprite(
          MEASUREMENT_SPRITE_W,
          MEASUREMENT_SPRITE_H) != nullptr);

  Serial.println(
      measurementSpriteReady
          ? "Anti-flicker measurement sprite ready."
          : "WARNING: sprite allocation failed; using padded text fallback.");

  touchSPI.begin(TOUCH_CLK, TOUCH_MISO, TOUCH_MOSI, TOUCH_CS);
  touch.begin(touchSPI);
  touch.setRotation(1);

  Wire.begin();
  Wire.setClock(100000);
// Keep the CYD backlight permanently enabled.
pinMode(TFT_BACKLIGHT_PIN, OUTPUT);
digitalWrite(TFT_BACKLIGHT_PIN, HIGH);

  mcpReady = mcp.begin_I2C(MCP_ADDR, &Wire);
  if (mcpReady)
  {
    initializeRelayOutputs();
    Serial.println("MCP23017 ready; all antennas PARKED.");
  }
  else
  {
    for (uint8_t antenna = 0; antenna < NUM_ANTENNAS; antenna++)
    {
      antennaState[antenna] = ANT_OFF;
    }
    Serial.println("ERROR: MCP23017 not found; switching disabled.");
  }

  adsReady = ads.begin(ADS_ADDR, &Wire);
  if (adsReady)
  {
    ads.setGain(GAIN_ONE);
    ads.setDataRate(RATE_ADS1115_475SPS);
    readMeasurements();
    Serial.println("ADS1115 ready: A0=F1 A1=R1 A2=F2 A3=R2.");
  }
  else
  {
    Serial.println("ERROR: ADS1115 not found.");
  }

  drawStaticGui();

  Blynk.config(BLYNK_AUTH_TOKEN);
  WiFi.mode(WIFI_STA);
  WiFi.persistent(false);
  WiFi.setAutoReconnect(true);
  startWifiAttempt();

  blynkTimer.setInterval(BLYNK_PUBLISH_INTERVAL_MS, publishBlynkStatus);

  lastMeasurementMs = millis();
  feedWatchdog();
}

void loop()
{

  feedWatchdog();

  handleTouch();
  serviceNetwork();
  blynkTimer.run();

  if (Serial.available())
  {
    processSerialCommand(Serial.readStringUntil('\n'));
  }

  const uint32_t now = millis();
  if ((now - lastMeasurementMs) >= MEASUREMENT_INTERVAL_MS)
  {
    lastMeasurementMs = now;
    readMeasurements();
    refreshMeasurementGui();
    ;
  }


  // Give the Wi-Fi and idle tasks CPU time without visible GUI delays.
  delay(1);
}
